{
  "projects": [
    {
      "title": "Built Accounting",
      "tooltip": "Mobile App",
      "description": "Built is a financial technology company with the vision of democratizing prosperity for small businesses in Africa. The enterprise deploys web and mobile technologies that help small businesses start, run and grow their businesses. The company’s flagship product is a financial record keeping application that enables small business owners easily keep and manage their financial data for quick data-driven decision making, and also to access a curation of financial services that suit their size and needs.  Working together with the team at Built Accounting, we've been able to successfully developed and deployed both the Android and a iOS applications that is used being by over 7,000 businesses across Africa.",
      "client": "Built Accounting Services",
      "images": [],
      "backgroundImage": "https://i.ibb.co/bzMKpXy/Finance-App.png",
      "image": "https://i.ibb.co/bzMKpXy/Finance-App.png",
      "links": [
        {
          "name": "Website",
          "url": "https://built.africa/"
        },
        {
          "name": "Android App",
          "url": "https://play.google.com/store/apps/details?id=com.builtaccounting.app"
        },
        {
          "name": "iOS App",
          "url": "https://apps.apple.com/gh/app/built-accounting/id1547855525"
        }
      ]
    },

    {
      "title": "Alvi Salon.",
      "tooltip": "Alvi Beauty Services Ltd.",
      "description": "A beauty service booking platform that allows users to book beauty services from the comfort of their homes. The system features four mobile app (two for iOS and two for Android) and a web dashboard for service providers as well as a super admin dashboard for the company. There''s a web version for users to book services as well.",
      "client": "Alvi Beauty Services LTD.",
      "images": [],
      "backgroundImage": "https://i.ibb.co/56btr6w/alvibeaty-SERVICE.png",
      "image": "https://i.ibb.co/56btr6w/alvibeaty-SERVICE.png",
      "links": [
        {
          "name": "Website",
          "url": "https://partner.alvibeauty.com/"
        },

        {
          "name": "Android App",
          "url": "https://play.google.com/store/apps/details?id=com.beautypoisk.salon"
        },
        {
          "name": "iOS App",
          "url": "https://apps.apple.com/us/app/alvi-salon/id1639258212"
        }
      ]
    },

    {
      "title": "Alvi Beauty",
      "tooltip": "Alvi Beauty Services Ltd.",
      "description": "A beauty service booking platform that allows users to book beauty services from the comfort of their homes. The system features four mobile app (two for iOS and two for Android) and a web dashboard for service providers as well as a super admin dashboard for the company. There''s a web version for users to book services as well.",
      "client": "Alvi Beauty Services LTD.",
      "images": [],
      "backgroundImage": "https://i.ibb.co/s23G1rC/alvibeaty-USER.png",
      "image": "https://i.ibb.co/s23G1rC/alvibeaty-USER.png",
      "links": [
        {
          "name": "Website",
          "url": "https://alvibeauty.com/"
        },
        {
          "name": "Android App",
          "url": "https://play.google.com/store/apps/details?id=com.beautypoisk.user"
        },
        {
          "name": "iOS App",
          "url": "https://apps.apple.com/us/app/alvi-beauty/id1640579339"
        }
      ]
    },

    {
      "title": "GetAll Ghana Ltd.",
      "tooltip": "On Demand Service Platform",
      "description": "An innovative on-demand service platform that serves as a robust intermediary between users and service providers in Ghana. Currently in development, the application is poised to be released to the public in the near future, with a public testing build currently available for download. The technological framework of this solution features two mobile applications, each tailored for iOS and Android operating systems, and a web dashboard that caters to the requirements of service providers. Additionally, a super admin dashboard has been designed to offer comprehensive administrative functionalities to the parent company.<br/>This platform has been designed to enhance the accessibility of essential services to the masses, providing a seamless means for users to connect with a diverse range of service providers. The application's underlying operational mechanism ensures that the system facilitates the matching of users with service providers in a timely, efficient, and cost-effective manner.<br/>The mobile applications have been meticulously crafted to provide a seamless user experience, allowing users to easily browse and select the services they require, view provider profiles and ratings, and book appointments at their convenience. The web dashboard for service providers offers an intuitive and user-friendly interface, facilitating the efficient management of bookings, appointment scheduling, and communication with users. Moreover, the super admin dashboard offers a powerful and robust platform for monitoring the system's performance, analyzing key metrics, and managing system-wide operations.<br/>Overall, the application is a dynamic and innovative solution that offers immense value to both users and service providers in Ghana. The system's feature-rich architecture, coupled with its intuitive user experience, ensures that the application is well-positioned to revolutionize the service industry and enhance the accessibility of essential services to the masses.",
      "client": "GetAll Ghana LTD.",
      "images": [],
      "backgroundImage": "https://i.ibb.co/TDXS4kp/getall.png",
      "image": "https://i.ibb.co/TDXS4kp/getall.png",
      "links": [
        {
          "name": "Website (Offline)",
          "url": "#"
        }
      ]
    },

    {
      "title": "Ejuma Africa Ltd.",
      "tooltip": "Book Keeping App",
      "description": "TThe Ejuma App represents a state-of-the-art solution that offers small and medium-sized enterprises (SMEs) a comprehensive suite of tools to effectively manage their debtors, staff, and financing needs. Through the utilization of this application, SMEs are empowered to undertake a wide range of tasks, including but not limited to the efficient management of their debtor accounts, human resources (HR) functions such as staff attendance and hiring processes, sales record-keeping, payment processing, and loan accessibility.<br/>One of the most notable features of the Ejuma App is its ability to provide SMEs with a powerful tool to streamline their debt collection processes. This function enables businesses to efficiently manage their debtors by tracking payments, generating invoices, and providing detailed reports on outstanding debts. Such capabilities allow for more effective cash flow management and help businesses to maintain healthier financial positions.<br/>Furthermore, the application provides SMEs with an efficient and convenient means of managing their HR requirements. With the ability to record staff attendance, streamline the recruitment process, and automate payroll calculations, the Ejuma App enables businesses to effectively manage their staffing needs with ease.<br/>The Ejuma App also provides a platform for businesses to record sales, accept payments, and access financing through the app's loan accessibility feature. This function helps to simplify the process of securing loans, allowing SMEs to access funding without the need for extensive documentation or cumbersome administrative procedures.<br/>Overall, the Ejuma App represents a powerful and versatile tool that offers SMEs a holistic solution to manage their finances, staffing requirements, and financing needs. By leveraging this innovative application, SMEs can optimize their operations, reduce administrative burdens, and focus on growth and development.",
      "client": "Built Accounting Services LTD.",
      "images": [],
      "backgroundImage": "https://i.ibb.co/VvfrPGK/fastercredit.png",
      "image": "https://i.ibb.co/VvfrPGK/fastercredit.png",
      "links": [
        {
          "name": "Website (Offline)",
          "url": "#"
        },

        {
          "name": "iOS App",
          "url": "https://apps.apple.com/bw/app/ejuma-business-app/id1590122096"
        }
      ]
    },

    {
      "title": "Inspect.MapThis.Site",
      "tooltip": "Drone Inspection App",
      "description": "This is a cutting-edge cloud-based software solution that has been ingeniously designed to cater to the needs of users who desire to conduct a detailed and in-depth inspection of transmission towers, wind turbines, solar panels, and other analogous structures. The software's operational mechanism is based on the utilization of unmanned aerial vehicles (UAVs), commonly referred to as drones, to capture high-resolution images of the said structures, which can then be examined in meticulous detail by the user. <br/> One of the most remarkable features of this platform is its ability to facilitate the annotation of images captured by the UAVs during the inspection process. By enabling users to add text, graphics, or symbols to the images, the application enhances the user's ability to comprehend and analyze the data being gathered in a more nuanced and detailed manner. The annotation function significantly enhances the value of the data being gathered during the inspection process by providing the user with the capability to highlight specific aspects of the structure being inspected that may require further examination or scrutiny.<br/>Furthermore, the software platform is equipped with an advanced reporting mechanism that enables the generation of detailed and comprehensive reports based on the data gathered during the inspection process. These reports offer a holistic and detailed perspective of the structural features and any anomalies or potential issues that may require further investigation or attention. The reporting functionality ensures that the user has a clear and concise understanding of the inspection process and the data that has been collected, allowing for better decision-making, planning, and resource allocation.<br/>Underlying the technological framework of this innovative application is React, a dynamic and versatile JavaScript library that is widely used for developing responsive and intuitive user interfaces. Additionally, the application utilizes NodeJS, a powerful and scalable JavaScript runtime environment, to execute JavaScript code outside of a web browser, providing increased flexibility and functionality. The use of these advanced technologies ensures that the application is robust, reliable, and offers an optimal user experience.",
      "client": "Usnatek- Mapthis.site",
      "images": [],
      "backgroundImage": "https://i.ibb.co/gg0rzNb/mapthis.png",
      "image": "https://i.ibb.co/gg0rzNb/mapthis.png",
      "links": [
        {
          "name": "Company Website",
          "url": "https://mapthis.site/inspection-reports-for-drone-inspections/"
        },
        {
          "name": "Web App",
          "url": "https://inspect.mapthis.site/"
        }
      ]
    },
    {
      "title": "Tipme ",
      "tooltip": "Tipping App",
      "description": "The app I have been involved in developing is a highly sophisticated and intricate solution, and represents one of the most complex software applications I have worked on thus far. The system is built on a robust and efficient backend, which was developed using the cutting-edge NodeJs platform. The Super Admin panel was constructed using Next.Js, while the mobile app was designed utilizing a combination of native development using Java and React Native for the user interface.<br/>The application serves as a powerful tool for street musicians seeking to showcase their talents and get discovered by audiences within their vicinity who have the app installed. Through the use of advanced iBeacon technology, the system facilitates the discovery of performers and their approximate locations, allowing audiences to tip or donate to them through the app.<br/>The application's iBeacon functionality is an integral component of its overall operational mechanism and enables users to create events or performances that are broadcasted via iBeacon, thereby increasing their visibility and exposure to nearby audiences. The system ensures that these events are discovered by nearby Givers, thus increasing the likelihood of successful performances and maximizing the earning potential for street musicians.<br/>The overall architecture of the app is highly sophisticated and has been designed to ensure optimal performance and user experience. The application's seamless integration of advanced technologies, such as iBeacon and React Native, sets it apart from other solutions in the market and provides a powerful tool for street musicians to showcase their talents and connect with their audiences.<br/>In conclusion, the app represents a state-of-the-art solution that offers immense value to street musicians and audiences alike. Its advanced technological features and user-friendly interface ensure that the app is well-positioned to revolutionize the way street performers showcase their talents and interact with their audiences.",
      "client": "Leonardo Inventions",
      "images": [],
      "backgroundImage": "https://i.ibb.co/kHGDg4K/TIPME2.png",
      "image": "https://i.ibb.co/kHGDg4K/TIPME2.png",
      "links": [
        {
          "name": "Website (Not Live)",
          "url": "https://tipme-app.com"
        },
        {
          "name": "Android App",
          "url": "https://play.google.com/store/apps/details?id=com.tipmeapp.tipme"
        }
      ]
    },
    {
      "title": "Remora Landing Page",
      "tooltip": "Remora Bank Landing Page",
      "description": "The landing page for the Remora Bank launch waitlist.",
      "client": "Remora Bank LTD.",
      "images": [],
      "backgroundImage": "https://i.ibb.co/Trvzt6X/Remora-Bank.png",
      "image": "https://i.ibb.co/Trvzt6X/Remora-Bank.png",
      "links": [
        {
          "name": "Website",
          "url": "https://remora.vercel.app/"
        }
      ]
    }
  ]
}
